# Pandas Series

In [1]:
import pandas as pd

In [2]:
obj1 = pd.Series([1, 2, 3, 5, -3])
print(type(obj1))

<class 'pandas.core.series.Series'>

In [3]:
print(obj1)

0    1
1    2
2    3
3    5
4   -3
dtype: int64

In [4]:
x = [1, 2, 4, 5, 3, 9]
obj2 = pd.Series(x)
print(obj2)

0    1
1    2
2    4
3    5
4    3
5    9
dtype: int64

In [5]:
print(obj1.values)

[ 1  2  3  5 -3]

In [6]:
print(obj1.index)

RangeIndex(start=0, stop=5, step=1)

In [7]:
obj2 = pd.Series(x, index = ['a', 'b', 'c', 'd', 'e', 'f'])
print(obj2)

a    1
b    2
c    4
d    5
e    3
f    9
dtype: int64

In [8]:
print(obj1[obj1 < 0])

4   -3
dtype: int64

In [9]:
print(obj1[obj1 > 0])

0    1
1    2
2    3
3    5
dtype: int64

In [10]:
c = 3
print(obj1 * c)

0     3
1     6
2     9
3    15
4    -9
dtype: int64

In [11]:
obj2.index = [0, 1, 2, 3, 4, 5]
print(obj2)

0    1
1    2
2    4
3    5
4    3
5    9
dtype: int64

# Pandas Dataframe

In [12]:
data = { 'city': ['Mumbai', 'Mumbai', 'Mumbai', 'Hyderabad', 'Hyderabad', 'Hyderabad'], 'year': [2010, 2011, 2012, 2010, 2011, 2012], 'population': [10.0, 10.1, 10.2, 5.2, 5.3, 5.5]}

In [13]:
print(data)

{'city': ['Mumbai', 'Mumbai', 'Mumbai', 'Hyderabad', 'Hyderabad', 'Hyderabad'], 'year': [2010, 2011, 2012, 2010, 2011, 2012], 'population': [10.0, 10.1, 10.2, 5.2, 5.3, 5.5]}

In [14]:
print(type(data))

<class 'dict'>

In [15]:
df1 = pd.DataFrame(data)
df1

        city  year  population
0     Mumbai  2010        10.0
1     Mumbai  2011        10.1
2     Mumbai  2012        10.2
3  Hyderabad  2010         5.2
4  Hyderabad  2011         5.3
5  Hyderabad  2012         5.5

In [16]:
df1.head()

        city  year  population
0     Mumbai  2010        10.0
1     Mumbai  2011        10.1
2     Mumbai  2012        10.2
3  Hyderabad  2010         5.2
4  Hyderabad  2011         5.3

In [17]:
df1.tail()

        city  year  population
1     Mumbai  2011        10.1
2     Mumbai  2012        10.2
3  Hyderabad  2010         5.2
4  Hyderabad  2011         5.3
5  Hyderabad  2012         5.5

In [18]:
df2 = pd.DataFrame(data, columns = ['year', 'city', 'population'])
df2

   year       city  population
0  2010     Mumbai        10.0
1  2011     Mumbai        10.1
2  2012     Mumbai        10.2
3  2010  Hyderabad         5.2
4  2011  Hyderabad         5.3
5  2012  Hyderabad         5.5

In [19]:
df3 = pd.DataFrame(data, columns = ['year', 'city', 'population', 'GDP'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [20]:
df3

       year       city  population  GDP
one    2010     Mumbai        10.0  NaN
two    2011     Mumbai        10.1  NaN
three  2012     Mumbai        10.2  NaN
four   2010  Hyderabad         5.2  NaN
five   2011  Hyderabad         5.3  NaN
six    2012  Hyderabad         5.5  NaN

In [21]:
print(df3.columns)

Index(['year', 'city', 'population', 'GDP'], dtype='object')

In [22]:
df3.year

one      2010
two      2011
three    2012
four     2010
five     2011
six      2012
Name: year, dtype: int64

In [23]:
print(df3['year'].dtype)

int64

In [24]:
print(df3.dtypes)

year            int64
city           object
population    float64
GDP            object
dtype: object

In [25]:
df3.loc['one']

year            2010
city          Mumbai
population        10
GDP              NaN
Name: one, dtype: object

In [26]:
df3.GDP = 10

In [27]:
df3

       year       city  population  GDP
one    2010     Mumbai        10.0   10
two    2011     Mumbai        10.1   10
three  2012     Mumbai        10.2   10
four   2010  Hyderabad         5.2   10
five   2011  Hyderabad         5.3   10
six    2012  Hyderabad         5.5   10

In [28]:
import numpy as np
df3.GDP = np.arange(6)
print(df3)

       year       city  population  GDP
one    2010     Mumbai        10.0    0
two    2011     Mumbai        10.1    1
three  2012     Mumbai        10.2    2
four   2010  Hyderabad         5.2    3
five   2011  Hyderabad         5.3    4
six    2012  Hyderabad         5.5    5

In [29]:
df3.GDP = [3, 2, 0, -.4, 7, 9]
print(df3)

       year       city  population  GDP
one    2010     Mumbai        10.0  3.0
two    2011     Mumbai        10.1  2.0
three  2012     Mumbai        10.2  0.0
four   2010  Hyderabad         5.2 -0.4
five   2011  Hyderabad         5.3  7.0
six    2012  Hyderabad         5.5  9.0

In [30]:
val = pd.Series([-1.4, 1.5, -1.3], index = ['two', 'four', 'five'])
df3.GDP = val
df3

       year       city  population  GDP
one    2010     Mumbai        10.0  NaN
two    2011     Mumbai        10.1 -1.4
three  2012     Mumbai        10.2  NaN
four   2010  Hyderabad         5.2  1.5
five   2011  Hyderabad         5.3 -1.3
six    2012  Hyderabad         5.5  NaN